tools/perf/tax-calculate.perf.yml
config:
  target: "https://tax.uamanager.dev"
  phases:
    - duration: 300
      arrivalRate: 1
      rampTo: 150

  processor: "./payload.processor.js"

scenarios:
  - flow:
      - post:
          url: "/api/v1/tax/calculate"
          json:
            year: 2023
            transactions:
              - ticker: "AAPL"
                date: "{{ randomDate('2022-01-01', '2022-12-31') }}"
                type: "BUY"
                currency: "USD"
                price: "{{ randomInt(400, 450) }}"
                qty: "{{ randomInt(100, 200) }}"
                fee_currency: "USD"
                fee_total_amount: "{{ randomInt(10, 50) }}"
              - ticker: "AAPL"
                date: "{{ randomDate('2023-01-01', '2023-12-31') }}"
                type: "SELL"
                currency: "USD"
                price: "{{ randomInt(300, 550) }}"
                qty: "{{ randomInt(50, 100) }}"
                fee_currency: "USD"
                fee_total_amount: "{{ randomInt(10, 50) }}"