tools/perf/tax-calculate.perf.yml
config:
  target: "https://tax.uamanager.dev"
  phases:
    - duration: 300
      arrivalRate: 1
      rampTo: 150

  processor: "./payload.processor.mjs"

scenarios:
  - flow:
      - post:
          url: "/api/v1/tax/calculate"
          beforeRequest: "randomOperationsPair"
          json:
            year: 2023
            transactions:
              - ticker: "AAPL"
                date: "{{ buy_date }}"
                type: "BUY"
                currency: "USD"
                price: "{{ buy_price }}"
                qty: "{{ buy_qty }}"
                fee_currency: "USD"
                fee_total_amount: "{{ buy_fee_total_amount }}"
              - ticker: "AAPL"
                date: "{{ sell_date }}"
                type: "SELL"
                currency: "USD"
                price: "{{ sell_price }}"
                qty: "{{ sell_qty }}"
                fee_currency: "USD"
                fee_total_amount: "{{ sell_fee_total_amount }}"